In [37]:
import pandas as pd

excel_data = pd.read_excel("sample.xlsx")

# print(excel_data) 
# print(excel_data.head())

print(excel_data.columns) #untuk melihat nama kolom

Index(['Waktu', 'Responden', 'Kelas', 'Ruang', 'Kuis 1', 'Kuis 2', 'Kuis 3'], dtype='object')

In [38]:
print(excel_data['Responden'].head()) #untuk mengakses kolom responden; head():diambil data lima teratas

0    A
1    B
2    C
3    D
4    E
Name: Responden, dtype: object

In [39]:
excel_data.iloc[0] #untuk mengakses baris ke-0

Waktu        2020-02-18 12:59:05
Responden                      A
Kelas                        X A
Ruang                        R11
Kuis 1                         2
Kuis 2                         0
Kuis 3                         0
Name: 0, dtype: object

In [40]:
excel_data['Kelas'].iloc[0]  #mengakses kolom kelas pada baris pertama

'X A'

In [41]:
excel_data['Kelas'].iloc[1:3] #mengakses kolom Kelas pada baris ke-1 sampai baris kurang dari 3

1    X A
2    X A
Name: Kelas, dtype: object

In [42]:
excel_data.iloc[1:3] #mengakses baris ke (1,3]

                 Waktu Responden Kelas Ruang  Kuis 1  Kuis 2  Kuis 3
1  2020-02-19 07:04:24         B   X A   R11       3       0       2
2  2020-02-19 07:04:27         C   X A   R11       3       0       2

In [43]:
excel_data.describe(include="all") #untuk mengakses informasi statistika dari data

,Waktu,Responden,Kelas,Ruang,Kuis 1,Kuis 2,Kuis 3
count,475,475,475,475,475.000000,475.000000,475.000000
unique,462,26,6,6,NaN,NaN,NaN
top,2020-02-27 12:48:08,A,XI AA,R33,NaN,NaN,NaN
freq,5,36,143,159,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,1.623158,0.498947,2.829474
std,NaN,NaN,NaN,NaN,1.005832,0.500526,0.745149
min,NaN,NaN,NaN,NaN,0.000000,0.000000,0.000000
25%,NaN,NaN,NaN,NaN,1.000000,0.000000,2.000000
50%,NaN,NaN,NaN,NaN,2.000000,0.000000,3.000000
75%,NaN,NaN,NaN,NaN,2.000000,1.000000,3.000000
max,NaN,NaN,NaN,NaN,4.000000,1.000000,4.000000

In [44]:
excel_data.describe(exclude=['O']) #mengakses informasi statistik khusus data numerical

           Kuis 1      Kuis 2      Kuis 3
count  475.000000  475.000000  475.000000
mean     1.623158    0.498947    2.829474
std      1.005832    0.500526    0.745149
min      0.000000    0.000000    0.000000
25%      1.000000    0.000000    2.000000
50%      2.000000    0.000000    3.000000
75%      2.000000    1.000000    3.000000
max      4.000000    1.000000    4.000000